# GETTING AND KNOWING DATA

In [24]:
import pandas as pd
import numpy as np

## Step 1: Import DATASET

In [27]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [29]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 2: DATASET Overview

In [31]:
df.shape
#Ouput: (<số hàng> , <số cột>)

(4622, 5)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [29]:
#print all columns 'name'
list(df.columns)
#In ra tên trường

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [31]:
df.index
#rangeIndex(bắt đầu , kết thúc , bước)

RangeIndex(start=0, stop=4622, step=1)

In [35]:
round(df.describe(),3)
# Thống kê số với data type là int

       order_id  quantity
count  4622.000  4622.000
mean    927.255     1.076
std     528.891     0.410
min       1.000     1.000
25%     477.250     1.000
50%     926.000     1.000
75%    1393.000     1.000
max    1834.000    15.000

In [37]:
df.describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### LOC vs ILOC

In [40]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [50]:
df.loc[df.quantity == 15 ]
#I n ra thông tin cột quantity có giá trị = 15

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25

In [56]:
df.loc[ (df.quantity == 15) | (df.item_name == "Izze") ]

,order_id,quantity,item_name,choice_description,item_price
1,1,1,Izze,[Clementine],$3.39
24,12,1,Izze,[Grapefruit],$3.39
47,21,1,Izze,[Blackberry],$3.39
66,30,1,Izze,[Blackberry],$3.39
359,155,1,Izze,[Blackberry],$3.39
360,155,1,Izze,[Grapefruit],$3.39
430,186,1,Izze,[Grapefruit],$3.39
579,237,1,Izze,[Clementine],$3.39
580,237,1,Izze,[Grapefruit],$3.39
1059,436,1,Izze,[Clementine],$3.39
1213,495,1,Izze,[Clementine],$3.39
1611,651,1,Izze,[Blackberry],$3.39
1612,651,1,Izze,[Blackberry],$3.39
1680,680,1,Izze,[Clementine],$3.39
2088,842,1,Izze,[Clementine],$3.39
2619,1040,1,Izze,[Clementine],$3.39
2634,1046,1,Izze,[Clementine],$3.39
2758,1095,1,Izze,[Blackberry],$3.39
2891,1149,1,Izze,[Blackberry],$3.39
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25
3669,1468,1,Izze,[Blackberry],$3.39

In [58]:
df.loc[ (df.order_id == 155) & (df.item_name == "Izze") ]

     order_id  quantity item_name choice_description item_price
359       155         1      Izze       [Blackberry]     $3.39
360       155         1      Izze       [Grapefruit]     $3.39

In [60]:
# select all rows with multiple column conditions
df.loc[ (df.order_id == 155) & (df.item_name == "Izze"), ["order_id","quantity","item_name"] ]

     order_id  quantity item_name
359       155         1      Izze
360       155         1      Izze

In [64]:
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [66]:
df.iloc[9]

order_id                                                              5
quantity                                                              1
item_name                                                 Steak Burrito
choice_description    [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...
item_price                                                       $9.25
Name: 9, dtype: object

In [68]:
type(df.iloc[9])

pandas.core.series.Series

In [33]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [35]:
df.iloc[3:11, :-1]

,order_id,quantity,item_name,choice_description
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans..."
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou..."
6,3,1,Side of Chips,NaN
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables..."
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch..."
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto..."
10,5,1,Chips and Guacamole,NaN

## DATA MANIPULATION

In [39]:
df.item_price.dtype

dtype('O')

In [45]:
df.item_price.apply(lambda x: float(x.replace("$",""))).dtype

dtype('float64')

In [49]:
df.item_price = df.item_price.apply(lambda x: float(x.replace("$","")))

In [51]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [57]:
# Thêm cột
df['total_price'] = df['quantity'] * df['item_price']

In [59]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

## How much was the revenue for the period in the dataset ?

In [62]:
revenue = df['total_price'].sum()
print('Doanh thu: ',revenue)

Doanh thu:  39237.02

### Which was the most ordered item?

### Group By

In [67]:
c = df.groupby('item_name')['quantity'].sum()
c.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

### Số lượng mặt hàng đã bán ra

In [73]:
#Unique value 
# mat_hang_da_ban = df.item_name.value_counts().count()
# print('Mặt hàng đã bán: ',mat_hang_da_ban)

Mặt hàng đã bán:  50

In [77]:
print('Mặt hàng đã bán: ', df.item_name.nunique())

Mặt hàng đã bán:  50